project04/app/controllers/articles_controller.rb

  def create
    @article = Article.new(params[:article])
    @article.edit_count = 0

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("created_at", "title", "author", "body", "updated_at", "edit_count") VALUES('2011-02-07 01:16:01', 'Lorum', 'Ipsum', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer non pellentesque massa. Vestibulum in congue metus. Phasellus malesuada scelerisque dui vitae pretium. Phasellus quam nulla, mollis id ultricies quis, dictum at mi. Nunc gravida eros non odio congue non vehicula eros ultrices. Nam nec rutrum magna. In eu sem tellus, at sodales odio. Maecenas placerat, neque et ornare varius, ipsum ante tincidunt dolor, vel tincidunt risus orci at quam. Suspendisse potenti. Morbi dapibus libero quam. Etiam ac dui a nulla adipiscing suscipit eu in eros. Nam a quam ut sem volutpat sagittis eu eu neque. Fusce auctor, diam a laoreet auctor, leo quam adipiscing sapien, et consequat lectus tortor in mauris. Nulla enim nisl, pharetra id congue a, fermentum a est. Fusce dictum faucibus urna, in cursus justo imperdiet vitae. Praesent nulla lectus, consectetur nec cursus eleifend, molestie viverra quam. Ut dictum pellentesque ante, ut egestas risus tristique a. Duis eget lorem blandit augue ornare volutpat. Curabitur ac justo nisi, in mattis sapien.

  def update
    @article = Article.find(params[:id])
    @article.edit_count += 1

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2011-02-06 05:05:03', "edit_count" = 3, "body" = 'Lorem ipsum dolor sit amet, cccccccconsectetur adipiscing elit. In hendrerit malesuada dui, eu iaculis nulla commodo at. Proin felis nunc, congue ac suscipit ac, lobortis nec dui. Nullam ut neque dolor. Duis dictum mauris ac orci luctus porttitor. Praesent nibh metus, laoreet ut egestas vitae, pulvinar sed justo. Vivamus fringilla viverra fermentum. Vivamus ut arcu nibh, id placerat nibh. Ut suscipit nulla sit amet urna fermentum ut malesuada ante rutrum. Aenean eleifend, urna ornare interdum hendrerit, quam nunc posuere diam, at blandit massa lorem sed tortor. Curabitur faucibus, libero id pharetra pretium, lectus diam mollis lacus, ut sagittis quam velit in est.