project06/app/controllers/games_controller.rb

  def index
    @games = Game.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM "games" ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("rating", "created_at", "title", "updated_at") VALUES('good!~', '2011-02-28 05:57:16', 'test', '2011-02-28 05:57:16')