project06/app/controllers/members_controller.rb

  def index
    @members = Member.all
---
SELECT * FROM "members"

  def show
    @member = Member.find(params[:id])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)

  def create
    @member = Member.new(params[:member])
    if @member.save
---
INSERT INTO "members" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "last_name", "persistence_token", "first_name", "email") VALUES('2011-02-28 07:26:07', 'c062c2ff4216729e47c1437cec9f9e31a367a20dda6f48e496e7ac4a5bfd269ff17f0066079d51f359ef7be2e9cbd59ffb9f60730a0e90f8b1abd67361ef4294', '2011-02-28 07:26:07', 'dan', 'OSu3h9O5guVA1lN9KId', 'Hathorn', '495beb1d45ef32aa7361c7b369cce617022a07f6de1ea21d78283b95e4cacd9742fe9845c21723cbf2bf51431dafb3e553e83e031ddd9015cdd335c5a2aad72b', 'Dan', 'dhathorn@mines.edu')